[
    {
     "name": "Art Style Gallery",
     "type": "Art",
     "date": "2021-10-24T20:24:06.278Z",
     "count": 25,
     "desc": "The Art Stall is a cooperative gallery of fourteen professional painters, all residents of the Puget Sound area. For more than 50 years, our gallery has continued to thrive, thanks to the perseverance and creativity of its artists. Like an extended family , we share a commitment to each other as well as to the Art Stall and Pike Place Market",
     "eventsId": "1"
    },
    {
     "name": "Arts of Snohomish",
     "type": "Art",
     "date": "2021-10-24T09:07:17.608Z",
     "count": 25,
     "desc": "Arts of Snohomish is a 501(c) 3 non-profit cooperative gallery featuring the works of community-minded local artists and fine crafts people. Our mission is to contribute to the continuing revitalization of Historic Downtown Snohomish and the enrichment of the local arts community. For more than ten years AoS has been a showcase for the work of regional artists, with a variety of special events throughout the year. The gallery provides regular monthly shows as well as hosting benefit shows for students, challenged artists, and much more. We often feature local musicians as part of the gallery experience. Unpretentious and inviting, Arts of Snohomish is real art for real people.",
     "eventsId": "2"
    },
    {
     "name": "Avenue West Gallery",
     "type": "Art",
     "date": "2021-10-24T10:27:01.175Z",
     "count": 25,
     "desc": "Avenue West Gallery, a local artist co-op, features a range of media and styles created by some of the finest artists in the area.  One goal of the gallery is to provide an atmosphere where visitors can browse at their own pace or ask questions of the artist on duty.  Among the art forms are oil, acrylic, watercolor, mixed media paintings, and several photography styles.  The gallery also features prints, wood works, sculptures, greeting cards, pottery, and glass art.  The wide range of artist styles and subjects include landscapes, abstracts, florals, people, and more.  All works are for sale and are competitively prices.  We will ship out of town purchases.",
     "eventsId": "3"
    },
    {
     "name": "Ebb Tide Gallery",
     "type": "Art",
     "date": "2021-10-24T12:49:27.257Z",
     "count": 25,
     "desc": "Welcome to Ebbtide Art!  Showcasing incredible talent and celebrating local South Sound artists! It’s official! Fall is here! We have some great art that’ll surely get you in the fall mood!  Stop by and check out some great work by local artist. We are currently open from 11am-5pm! ",
     "eventsId": "4"
    },
    {
     "name": "Gallery North",
     "type": "Art",
     "date": "2021-10-24T22:15:13.480Z",
     "count": 25,
     "desc": "Located in downtown Edmonds, Gallery North has been part of the Pacific Northwest art community since its creation as a cooperative venture in 1961. From that time, it has provided an authentic venue with a casual atmosphere where the public can view and purchase art work created by local artists. Browsers enjoy a new exhibition of paintings and photography each month, as well as sculpture, pottery, woodwork, fused glasswork, and jewelry. All of the original artwork is created by Gallery North members, while each purchase supports the gallery and its efforts to keep this unique community tradition alive. Gallery North is currently open seven days a week.",
     "eventsId": "5"
    },
    {
     "name": "Gallery Row",
     "type": "Art",
     "date": "2021-10-24T14:24:45.122Z",
     "count": 25,
     "desc": "Showcasing incredible talent and celebrating artists everywhere!",
     "eventsId": "6"
    },
    {
     "name": "Parklane Gallery",
     "type": "B2B",
     "date": "2021-10-25T01:59:15.055Z",
     "count": 35,
     "desc": "Parklane Gallery has been at the heart of the Kirkland/Eastside area fine-art community since 1991. Located across Lake Washington from Seattle in beautiful downtown Kirkland, Washington, its 40 resident Northwest artists provide a rich diversity of media and styles, both contemporary and traditional, including paintings, photography, digital art, sculpture, glass and artisan jewelry.Gallery artists run all aspects of the business and are informative and helpful to first-time visitors and established collectors as they enjoy the friendly atmosphere of this lakefront community. Park Lane, the short cobblestone street in front of the gallery was recently named one of five “Great Places” by the American Planning Association due to its urban design and walkability and is a beacon for residents and tourists alike with street sculptures, boutique shops, sidewalk cafes and, of course, Parklane Gallery.The Gallery hosts multiple featured artists each month plus juried shows for local, national and international artists. Parklane Gallery’s website constantly evolves to include current and future events in the gallery, and brief biographies of its artist members in an online store with every piece of art currently available.",
     "eventsId": "7"
    },
    {
     "name": "Punch Gallery",
     "type": "Art",
     "date": "2021-10-24T05:58:02.981Z",
     "count": 35,
     "desc": "From its 10-year history as a gallery in Seattle, to its current initiative as a rural arts collective, PUNCH has worked to promote visual dialogue between urban and rural art communities. In our ongoing effort to promote artwork that is thoughtful, fresh and contemporary coupled with our desire to further bridge urban rural connections, PUNCH Projects seeks to support the cultural vibrancy of rural art scenes by spurring creative awareness, cross-cultural engagement and economic vitality.",
     "eventsId": "8"
    },
    {
     "name": "Dillanos Coffee Roasters",
     "type": "Coffee",
     "date": "2021-10-24T11:35:16.493Z",
     "count": 35,
     "desc": "A passion for entrepreneurship and a drive for success, David Morris set out on a venture and founded Dillanos Coffee Roasters. Dillanos, named after his oldest son Dillon, opened as an espresso cart in 1992 in front of the well-known Sunshine Mart, a convenience store located in Buckley, Washington. The Sunshine Mart, which still stands today, was owned, and operated by Howard Heyer, David’s stepfather. Howard, or Howie as many called him, took a chance with David and his coffee cart and the two developed a business partnership. The cart was fueled by David’s enthusiasm, Howard’s business background, and a sincere desire to offer great coffee and great service. The following year they set out and opened two more retail locations and would begin to make decisions that would shape the business for years to come. In 1995, David’s brother, Chris Heyer, joined the family business at the age of 18 and bought into the company as a third owner. Chris had worked as an experienced barista at a coffee cart outside of a local grocery store. Together they bought their first 20-pound coffee roaster to kick off Dillanos Coffee Roasters as a wholesale coffee roasting operation. It wasn’t long before the brothers were soaking up information from coffee professionals throughout the country. They learned from the ground up what it takes to source high-quality green coffee, perfect nuanced roast profiles, and create balanced, smooth-tasting blends. They were passionate about the artistry of bringing out a coffee’s inherent character with just a small nudge of time and temperature. They soon sold the retail stores and put all their energy into wholesale roasting at a new location in Sumner, Washington. As the family business continued to expand, Dillanos Coffee Roasters grew from a tiny three-person outfit to a nationally recognized roaster with more than 10,000 customers across the country. Today, Dillanos Coffee Roasters employs more than 80 enthusiastic staff members and roasts for some of the country’s most recognized specialty coffee brands and cafes. In the face of all this exciting growth, the Dillanos mission statement remains the same: HELP PEOPLE, MAKE FRIENDS, and HAVE FUN!",
     "eventsId": "9"
    },
    {
     "name": "Jay Berry's Cafe",
     "type": "Coffee",
     "date": "2021-10-25T03:50:05.556Z",
     "count": 15,
     "desc": "Hours:Mondays: Closed, Tuesdays: Closed, Wednesdays: 7am-9pm, Thursdays: 7am-9pm, Fridays: 7am-9pm, Saturdays: 7am-9pm, Sundays: 7am-9pm, Lounge: 7am-11pm. Thank you for your continued support and patience as we navigate these uncertain times.",
     "eventsId": "10"
    },
    {
     "name": "Flying Heritage & Combat Armor Museum",
     "type": "Museum",
     "date": "2021-10-24T09:20:34.703Z",
     "count": 50,
     "desc": "The Flying Heritage & Combat Armor Museum facility is located at the southeast corner of Paine Field in Everett, Wash. FHCAM is a rare private collection of WWII era aircraft, tanks, combat armor and other technologies, painstakingly restored to working condition and displayed alongside interactive multimedia exhibits like Why War: The Causes of Conflict. Attendees will often find FHCAM mechanics working on restoration and maintenance as they explore the museum, providing a unique opportunity to ask questions and learn more about the process of bringing historic technology back to life. FHCAM is more than a passive display of vintage machines, it allows attendees to hear, smell, feel and watch history come to life at museum events hosted throughout the year. We suggest you allow yourself one to two hours to enjoy the collection and exhibit components. Your visit can include a self-guided tour throughout the facility, an in-depth tour with a knowledgeable docent, or a scheduled group in advance of your arrival.",
     "eventsId": "11"
    },
    {
     "name": "Yakama Nation Museum & Cultural Center",
     "type": "Museum",
     "date": "2021-10-24T12:20:09.660Z",
     "count": 100,
     "desc": "The Yakama Nation Cultural Center Campus is a unique facility. We have the Yakama Nation Museum, Yakama Nation Cultural Center Gift Shop, Heritage Theater, Yakama Nation Library, and the iconic Winter Lodge.The Yakama Nation Cultural Center is open to the general public seven days a week and is a wonderful cultural experience!",
     "eventsId": "12"
    },
    {
     "name": "Farelli's Pizza",
     "type": "Food",
     "date": "2021-10-25T02:04:34.725Z",
     "count": 50,
     "desc": "Our Tacoma location is our most metropolitan store, located on 6th & Union in the heart of the 6th Ave. nightlife scene! This Farrelli’s also has a large family friendly restaurant side with a private party loft and arcade game area, perfect for birthday parties or just a night out with the family. Tacoma Farrelli’s is our Late Night Hotspot, perfect for industry folk or night owls in general, and with the University of Puget Sound just blocks away, Tacoma Farrelli’s is also a favorite UPS Logger hangout…see you tonight!",
     "eventsId": "13"
    },
    {
     "name": "Frankie & Jo's",
     "type": "Food",
     "date": "2021-10-24T15:56:46.576Z",
     "count": 15,
     "desc": "Frankie & Jo’s Ballard is on one of our favorite streets in the city! It is also the street where owners Kari Brunson and Autumn Martin first met. This shop has all of your favorite flavors from Capitol Hill, a secret succulent garden, and lots more pints to take to go.",
     "eventsId": "14"
    },
    {
     "name": "Round 1",
     "type": "Amusement",
     "date": "2021-10-25T03:54:42.476Z",
     "count": 150,
     "desc": "Step on in and discover new games, play your favorites, and enjoy exclusive games imported straight from Japan.",
     "eventsId": "15"
    },
    {
     "name": "Bagel Boss",
     "type": "Bagel Shop",
     "date": "2021-10-24T06:40:06.202Z",
     "count": 8,
     "desc": "Bagel shop with the most authentic and affordable bagels for to go!",
     "eventsId": "16"
    },
    {
     "name": "Cold Spoons Creamery",
     "type": "Icecream Shop",
     "date": "2021-10-25T00:51:39.421Z",
     "count": 6,
     "desc": "Icecream shop that offers 50 different unique flavors of ice cream. A local favorite!",
     "eventsId": "17"
    },
    {
     "name": "Hudson Park",
     "type": "Outdoor Park",
     "date": "2021-10-25T01:17:29.414Z",
     "count": 50,
     "desc": "A park with a view of the Hudson Lake. Enjoy the sun with a nice picnic, sports, and more!",
     "eventsId": "18"
    },
    {
     "name": "State Fair",
     "type": "Fair / Carnival",
     "date": "2021-10-25T03:11:09.440Z",
     "count": 150,
     "desc": "The annual state fair is back with amusement rides, street foods, and local shops!",
     "eventsId": "19"
    },
    {
     "name": "Art Museum",
     "type": "Museum / Tourism",
     "date": "2021-10-24T16:08:37.896Z",
     "count": 100,
     "desc": "Our city's biggest and most famous museum that features many of the most well known modern art.",
     "eventsId": "20"
    },
    {
     "name": "Husky Stadium",
     "type": "Sporting Event",
     "date": "2021-10-25T03:47:56.754Z",
     "count": 40000,
     "desc": "The Univerisity's very own stadium that features many of the years most exciting sporting events.",
     "eventsId": "21"
    },
    {
     "name": "Alki Beach",
     "type": "Outddors / Beach",
     "date": "2021-10-25T02:55:16.682Z",
     "count": 100,
     "desc": "A beach in near Seattle with campfires, picnic tables and more.",
     "eventsId": "22"
    },
    {
     "name": "K's Karaoke Bar",
     "type": "Nightlife",
     "date": "2021-10-24T20:29:15.608Z",
     "count": 30,
     "desc": "Enjoy the nights of our city singing your favorite songs at our Karaoke Bar.",
     "eventsId": "23"
    },
    {
     "name": "Rattle Snake Ridge",
     "type": "Outdoors / Hike",
     "date": "2021-10-24T12:21:58.192Z",
     "count": 50,
     "desc": "A beginner's hike that features a great view. ",
     "eventsId": "24"
    },
    {
     "name": "AMC Movie Theater",
     "type": "Cinema",
     "date": "2021-10-24T06:26:30.674Z",
     "count": 300,
     "desc": "The biggest movie theater in the city that features all of your favorite movies and great ergonomic chairs",
     "eventsId": "25"
    },
    {
     "name": "The Botanical Gardens",
     "type": "Outdoors / nature",
     "date": "2021-10-24T09:56:34.020Z",
     "count": 20,
     "desc": "A botanic garden with a great trail and picnic tables.",
     "eventsId": "26"
    },
    {
     "name": "Pier 43",
     "type": "Tourism",
     "date": "2021-10-24T07:36:10.917Z",
     "count": 50,
     "desc": "A Pier with great local restaurants and shops.",
     "eventsId": "27"
    },
    {
     "name": "Farmers Market",
     "type": "Shopping",
     "date": "2021-10-24T17:54:08.301Z",
     "count": 50,
     "desc": "A weekly farmers market that features the freshest produces and hand-made trinkets",
     "eventsId": "28"
    },
    {
     "name": "Gaming Lounge",
     "type": "Gaming",
     "date": "2021-10-24T15:10:58.275Z",
     "count": 50,
     "desc": "A gaming lounge that features the best PCs and fastest internet speeds.",
     "eventsId": "29"
    },
    {
     "name": "B's Billards",
     "type": "Recreation",
     "date": "2021-10-24T09:30:44.266Z",
     "count": 20,
     "desc": "A Local Billards with the most afforable games of 8-ball.",
     "eventsId": "30"
    },
    {
     "name": "Aversano's Italian Restaurant",
     "type": "Food",
     "date": "2021-10-25T01:24:33.602Z",
     "count": 75,
     "desc": "We call your attention to the fine handcarved back bar. Built in 1897 by the Brunswisk-Balke-Collender Company in Alabama the bar was shipped around South American’s Cape Horn and was installed in the Mecca Saloon on First Avenue in Seattle in 1915. It was shipped to Cle Elum where it was used as a Saloon Bar until Prohibition ans was installed in the Aitorest Cade in Cle Elum in 1918-1976 then it was moved to Sumner and installed in the HARDTIMES 1977.",
     "eventsId": "31"
    },
    {
     "name": "Beach Cafe Restaurant",
     "type": "Food",
     "date": "2021-10-24T06:37:33.546Z",
     "count": 100,
     "desc": "Beach Café is a casual dining waterfront restaurant on the shores of Lake Washington. Chef Brian Doherty has created an innovative seasonally influenced menu featuring daily seafood specials and signature dishes. As directed by King County, beginning October 25, 2021 all guests dining at Beach Café 12-years of age and older will be required to show proof of vaccination.",
     "eventsId": "32"
    },
    {
     "name": "Big Fish Grill",
     "type": "Food",
     "date": "2021-10-24T06:21:26.193Z",
     "count": 75,
     "desc": "`Fresh, inviting, simply perfect` is our motto at Big Fish Grill.We are best known for our fresh seafood prepared & served with a Northwest twist. From our seafood cobb salad, seared sea scallops and coconut crusted rockfish, to our hand dipped halibut fish & chips, we prepare and serve our food with the freshest products available, always keeping our guests in mind. We have more than just seafood! Our Wagyu Bacon Cheddar Burger is a favorite, along with chicken piccata, and our tender, juicy New York and Top Sirloin steaks. We pride ourselves in customer service with a personal touch and when a guest dines with us we want them to feel as though they are in our home",
     "eventsId": "33"
    },
    {
     "name": "Billy Mchale's Restaurant",
     "type": "Food",
     "date": "2021-10-24T09:11:34.369Z",
     "count": 75,
     "desc": "Hours: Mon – Sun 11:00 am – 2:00 am. The new Billy McHale’s has pool table, darts, happy hour, live bands, a banquet room and catering. All parts of the restaurant including the cuisine, design and service transport our guests to comfort, fun and nightlife admidst the hubbub of urban life. The design of the restaurant is all about reinvention and restoration with a collection of glowing Edison light bulbs, corrugated metal, 100 year old barn wood, and original construction to create a truly unique space in that Federal Way has never seen before. Services: Takes Reservations, Walk-Ins Welcome, Good For Groups, Good For Kids, Take Out, Delivery, Catering, Waiter Service and Outdoor Seating. We accept: Visa, American Express, Mastercard and Discover",
     "eventsId": "34"
    },
    {
     "name": "Black Diamond Grill",
     "type": "Food",
     "date": "2021-10-24T05:31:36.146Z",
     "count": 75,
     "desc": "Black Diamond Grill was born in a small kitchen three generations ago. While still prioritizing to be a family-oriented and community-serving destination, we have continuously strived to perfect our traditional recipes while also creating innovative new recipes from scratch. Our Founder and Executive Chef, Rudy Carrillo, has gained vast experience from his love and commitment towards cooking in his kitchen. His dedication to providing an enriching experience is present from the moment you walk in. He, alongside his family, welcomes you and your family to Black Diamond Grill. We are still open, and doing online-orders!",
     "eventsId": "35"
    },
    {
     "name": "Boat Shed Restaurant",
     "type": "Food",
     "date": "2021-10-25T04:34:34.703Z",
     "count": 50,
     "desc": "Serving local favorites, fresh seafood and great views for over 40 years on the Manette Waterfront! At the Moment we are not taking reservations, but walk-ins welcome! We open at 11 daily,  See you soon!",
     "eventsId": "36"
    },
    {
     "name": "The Brooklyn Seafood, Steak & Oyster House",
     "type": "Food",
     "date": "2021-10-24T09:16:40.545Z",
     "count": 75,
     "desc": "Sprawling steakhouse & oyster bar with sizable wine & beer lists, plus a bustling happy hour.",
     "eventsId": "37"
    },
    {
     "name": "Cafe Presse",
     "type": "Food",
     "date": "2021-10-24T19:55:57.508Z",
     "count": 50,
     "desc": "Café Presse and Le Pichet owners Jim Drohman and Joanne Herron  have both long been fascinated by the food, wine and lifestyle of  France. Jim left a career in Aeronautical Engineering to train in the  cuisine at l’Ecole Superior de Cuisine Jean Ferrandi in Paris. He also  worked at several restaurants, including Le Boudin Sauvage and the  Michelin rated Le Coq de la Maison Blanche. In 1991, he returned to  Seattle and was chef at both Campagne and Café Campagne. Joanne has worked in the service industry since 1981, including over  12 years at Market Place Caterers/The RUINS. Her interest in France  began with her first visit to the French countryside at age 19 and has  grown through many professional and personal visits. She has spent  extensive time touring the wine producing regions of France, learning  firsthand from winemakers and importers and has participated in the 'vendage' or harvest of grapes in the Loire Valley. Jim and Joanne opened Le Pichet  in 2000 with the hope of recreating the personal, neighborhood style of  restaurant they had come to love in France. Le Pichet continues to  serve the Pike Place Market neighborhood under their direction and the  supervision of Le Pichet Chef de Cuisine Vince Cooper and Dining Room  Manager Sophie Guerrero. With Café Presse, Jim and Joanne have build another type of Parisian  institution, a Bar/Café: the sort of place that Parisians use as an  alternative living room, to enjoy coffee and croissants in the morning,   lunch, dinner or drinks throughout the day or for a late night bite or a  night cap until 1am.",
     "eventsId": "38"
    },
    {
     "name": "Canyon River Grill",
     "type": "Food",
     "date": "2021-10-24T11:42:22.364Z",
     "count": 50,
     "desc": "The restaurant overlooks the river and its adjoining cliffs. It's a place of both energy and serenity, beautiful in all seasons. Whether dining inside or on our deck, the restaurant provides all our guests an obstructed, sensational view of the natural wonder that is the Canyon. Join us and enjoy memorable meals while watching the world, and river, go by. We aspire to make you want to come back again and again.",
     "eventsId": "39"
    },
    {
     "name": "Chinoise Sushi Bar & Asian Grill",
     "type": "Food",
     "date": "2021-10-25T03:41:46.451Z",
     "count": 75,
     "desc": "Founded in Seattle by chef and restaurateur Thoa Nguyen, Chinoise Sushi Bar & Asian Grill is a contemporary Pan-Pacific Rim restaurant defined by their fresh, beautiful food from sushi to pho and wok dishes to summer salad rolls. Approachable Asian, affordable, fun, friendly, and authentic. Chef, restaurateur and Northwest culinary influencer Thoa Nguyen was born in Saigon and raised in Cho Lon, the city’s Chinatown district. In April 1975, at the age of 11, Thoa and her family left Vietnam for America and settled in Denver, Colorado. She then moved to Washington State in 1991 and quickly fell in love with the Pacific Northwest and the bounty found in its fields, pastures and waters. Serial entrepreneur Chef Thoa opened her first restaurant to accolades in 1996, the Pan Asian, Chinoise Café. Chinoise grew to three locations by 2000. She also opened The Islander on the southern border of Pike Place Market in downtown Seattle in 2003 and Wabi-Sabi Sushi Bar & Restaurant and the award winning Thoa’s Restaurant & Lounge, both in 2009. Chef Thoa’s restaurants are trend-setting in merging cuisines that span across the Asian continent with Northwest sensibilities. Chef/owner Thoa is a purist, who seeks out the very best ingredients and prepares authentic, yet approachable food that her loyal customers crave. She has been able to adapt her operations in an ever changing business landscape and economy and has managed to have her restaurants thrive. Chef Thoa currently owns and operates Chinoise in the Issaquah Highlands and Sushi Chinoise in Bothell",
     "eventsId": "40"
    },
    {
     "name": "Colophone Cafe",
     "type": "Food",
     "date": "2021-10-25T03:20:11.242Z",
     "count": 50,
     "desc": "Let us treat you to a unique and memorable dining experience that has been a Fairhaven tradition since 1985! The Colophon Cafe was founded in 1985 and has been the heart of Historic Fairhaven ever since. We began as a humble ice cream and espresso parlor adjacent to Village Books; that proximity and relationship with the bookstore helped influence our name (see inside the menu for a definition). Over the years, we have kept pace with our customers appetites by regularly refining and adding to our menu. From our creative, award-winning soups, to the freshest salads and sandwiches, to savory quiches and pot pies, to our decadent desserts and delicious beverages, we aspire to bring you a healthful and delicious meal any time of day. All of our foods are prepared using wholesome, quality ingredients, and served with pride by our talented and friendly staff. Of the many things that make our restaurant special, one in particular is that we strive to satisfy the needs and desires of each customer on an individual basis. Every meal is made to order, with the time and attention it takes to get things right. Among our wide variety of mouth-watering options are many unique and delicious vegetarian and gluten-free alternatives. In addition, we have compiled a comprehensive listing of our ingredients to help us accommodate dietary restrictions and food allergies. If you have a special need or request, or merely want to know what's in an item, don't hesitate to ask! We are truly proud of the deep connection that the Colophon Cafe has cultivated during our long tenure in this extraordinary community. In appreciation for our customers and neighbors, we are dedicated to business practices that promote both a healthy environment and a vibrant local economy. To that end, we support many local charities, and we purchase a significant amount of our ingredients and supplies from quality, locally owned businesses. The Colophon Cafe is an active member of Sustainable Connections, a participant in the Community Energy Challenge and Puget Sound Energy's Green Power program, a founding partner of Bellingham's Toward Zero Waste initiative, and a Whatcom Watershed Business Steward. Thank you for joining us today, and we look forward to seeing you again soon Sincerely, The Killian Family & Staff of the Colophon Cafe",
     "eventsId": "41"
    },
    {
     "name": "Double Eagle Steak & Seafood",
     "type": "Bar",
     "date": "2021-10-24T18:02:51.619Z",
     "count": 50,
     "desc": "CUISINES: American, Bar, Seafood, Pub. MEALS: Dinner. FEATURES: Reservations, Seating, Serves Alcohol, Wheelchair Accessible, Table Service, Gift Cards Available",
     "eventsId": "42"
    },
    {
     "name": "Eastlake Bar & Grill",
     "type": "Bar",
     "date": "2021-10-24T10:13:57.307Z",
     "count": 75,
     "desc": "Casual eatery with a simple American menu known for its huge patio with views of Lake Union.",
     "eventsId": "43"
    },
    {
     "name": "El Ranchon Family Mexican Restaurant",
     "type": "Food",
     "date": "2021-10-24T20:40:34.685Z",
     "count": 25,
     "desc": "El Ranchon Family Mexican Restaurant was established in 1996 in the Magnolia Village Neighborhood of Seattle, Washington and has served the Magnolia community throughout the years providing quality service, amazing Margaritas, and a fun environment for all to enjoy. Call now to place your order for takeout or schedule a catering event!",
     "eventsId": "44"
    },
    {
     "name": "Family Pancake House",
     "type": "Food",
     "date": "2021-10-24T12:22:47.291Z",
     "count": 25,
     "desc": "Welcome to the Family Pancake House. Family Pancake House serves delicious meals made from scratch with fresh, local, quality ingredients. Since 1963, our restaurants have been family-owned and operated. Visit us today for breakfast, lunch, dinner and/or dessert. Our professional and courteous staff is dedicated to providing you with an enjoyable and tasty dining experience. Family Pancake House offers five different restaurant locations throughout the northwest Washington area. Northwest Washington has thousands of interesting things to see and do. The area is filled with scenic beauty, arts and cultural attractions, fascinating history and geology, and outdoor recreation. Come visit the relaxing family atmosphere of the Edmonds location just 10 min. east of the active village and waterfront of Edmonds. At the Edmonds’ Family Pancake House, you can enjoy one of our delicious menu items made to order with the best ingredients around. Ask your friendly server about our specialties. Family Pancake House is also conveniently located in Redmond. Redmond is a bustling town, home of Microsoft and Nintendo, and offers residents and visitors an extensive park system, plentiful shopping, and outdoor recreation. Our courteous staff at the Redmond Family Pancake House is looking forward to your visit. In addition to many food selections, there are a variety of desserts and beverages for you to choose. We have two locations in Bremerton, a beautiful city on the Puget Sound, just a ferry ride away from Seattle. Stop by and have an omelette or a waffle for breakfast. About The Family Pancake House Family Pancake House has been locally owned and operated by Robert C. Mathwig for more than fifty years. Mr. Mathwig continues to oversee his operations to maintain the high quality menu he started in 1963. The majority of the meals served at the restaurants are still made from scratch. The Family Pancake House menu offers a variety of items ranging from Eggs Benedict and Swedish Pancakes, to fresh Salmon and Snap Crab Claws prepared to order anytime of the day. In addition to the extensive food selection, there are a variety of desserts and daily specials. Beverages include hand-made, old-fashioned milkshakes; root beer floats; iced or hot lattes; and beer and wine. Family Pancake House is committed to community involvement. Employees and managers donate their time and About the Family Pancake House experience on ball fields and in classrooms. The company sponsors youth sports teams and camps, 4-H, and holds a Cowboy Breakfast at the rodeo and Santa Breakfast at the fairgrounds. Family Pancake House is always trying to give back to friends and family in the community. There are currently five Family Pancake House restaurant locations in Washington: Edmonds, Redmond, West Bremerton, East Bremerton, and Port Orchard. We invite you to come and visit us, not only for a delicious meal, but also for a great family environment.",
     "eventsId": "45"
    },
    {
     "name": "Endolyne Joe's",
     "type": "Food",
     "date": "2021-10-25T03:47:10.134Z",
     "count": 25,
     "desc": "Endolyne Joe's joined the Fauntleroy community of West Seattle by opening in 2004. Since that time, Joe’s has been a West Seattle fixture in the community for breakfast, lunch and dinner seven days a week. Named after a ne’er do well conductor on the trolley line that was built in 1907 to connect downtown Seattle to the oldest and biggest neighborhood of West Seattle, Joe was known as a lady’s man with a penchant for the curve of a leg and a shot or three of a potent spirit. The last stop or end-of-the-line of this streetcar service from downtown was just one block south of the restaurant and this community was as a result, coined 'Endolyne'. We have been offering 'rotating' menus focused on the 'Foods of the Americas' since opening with our emphasis on North, Central and South American regions. One quarter, we may be offering a menu featuring the foods and beverages of Brazil which may be followed up with a New Orleans or perhaps a Costa Rican menu. These quarterly menu changes include new regional food & beverage offerings as well as an artwork and music program of the regions we explore. These rotating menus are accompanied by our seasonal base menu that offers an assortment of American comfort food selections for breakfast, lunch and dinner. Please note that we do not directly work with any third-party delivery services such as Uber Eats or Grubhub, and we cannot take responsibility for their order accuracy or service.  While we do receive orders from delivery services, we have no way to determine such orders originate from a third-party company.  In the event that there is an error in an order you place through a third-party delivery service, please contact them directly to make it right",
     "eventsId": "46"
    },
    {
     "name": "Bellevue Square",
     "type": "Shopping",
     "date": "2021-10-24T07:30:56.951Z",
     "count": 1000,
     "desc": "Bellevue Square is a shopping center in Bellevue, Washington. The mall has over 200 retail stores with anchors Macy's and Nordstrom. Bellevue Square also offers concierge services, valet parking, and children's play area. It and the connecting Lincoln Square comprise The Bellevue Collection.",
     "eventsId": "47"
    },
    {
     "name": "Northgate Station",
     "type": "Shopping",
     "date": "2021-10-24T21:21:24.432Z",
     "count": 1500,
     "desc": "Northgate Station is an enclosed shopping mall in Seattle, Washington, United States. It is located in the Northgate neighborhood on Interstate 5, adjacent to Northgate Way and Northgate station, a light rail station. The mall is anchored by Barnes & Noble, Bed Bath & Beyond, and Nordstrom Rack.",
     "eventsId": "48"
    },
    {
     "name": "University Village",
     "type": "Shopping",
     "date": "2021-10-24T12:49:38.464Z",
     "count": 1500,
     "desc": "Located just 10 minutes from downtown, University Village is Seattle’s only outdoor lifestyle shopping center, offering a unique mix of locally-owned boutiques, signature national retailers, and a distinct collection of restaurants and eateries. With more than 120 stores and restaurants, University Village is the exclusive destination in Washington to find notable brands such as Room & Board, RH Gallery, Brandy Melville, Pottery Barn Kids, and Scotch & Soda. University Village’s many restaurants range from casual outdoor dining to date night, and include local favorites such as Elemental Wood Fired Pizza and internationally renowned cuisine at Din Tai Fung. Since the late 1950’s, University Village has been a fixture in the surrounding neighborhoods of Laurelhurst, Ravenna and Bryant. The Village has always been home to beloved local stores and restaurants, some which have been in business for more than 30 years including The Confectionery, Pasta & Co., Village Maternity, and Ravenna Gardens. University Village is also where to find the second-ever Starbucks Coffee location, which opened in 1972, and the oldest family-owned drugstore in the nation, Bartell Drugs. Today, University Village includes more than 40 local stores and restaurants and, as always, free parking for our customers year-round. At University Village, supporting cancer research and the health, wellness and education of children is an important part of being involved in our local community. For more than 10 years, University Village has had valued partnerships with Fred Hutchinson Cancer Research Center and Ronald McDonald House Charities of Western Washington & Alaska through annual community events. With $17 million raised to date, University Village is the proud Lead Out sponsor of Obliteride, a unique fundraising bike ride to benefit Seattle’s Fred Hutch where 100% of funds raised go directly to cancer research.",
     "eventsId": "49"
    },
    {
     "name": "Westfield Southcenter",
     "type": "Shopping",
     "date": "2021-10-25T05:15:32.624Z",
     "count": 1500,
     "desc": "2-level indoor shopping mall with more than 200 stores & eateries plus a multiplex with IMAX.",
     "eventsId": "50"
    }
   ]